Examinator/src/Catalogs/ЗаданияСУО/ЗаданияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаданияСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КаталогМероприятийСУО</owners>
  <owners>Catalog.Пользователи</owners>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначимостьОценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраницВопросов</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьСтраницыВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтандартныеНастройкиТеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокВыполненияЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВБиблиотеку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВБиблиотеке</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДополнительныеМатериалы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодВыбораПопыткиПрохождения</name>
    <type>
      <types>EnumRef.МетодВыбораПопыткиПрохожденияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательВыставляетОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПрикреплениеФайлаКОтвету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЖдатьПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ЗаданияСУО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Владелец) И ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		
		ЭлектронноеМероприятие  = Объект.Владелец.Вид.Электронное;
		ТребуетсяПреподаватель  = Объект.Владелец.Вид.ТребуетсяПреподаватель;
		
		// Примечание: для новых объектов алгоритм получения этих данных другой.
		// См. обработчик события ПриОткрытии.
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
			Объект.Владелец = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		ТребуетсяПреподаватель = Истина;
		ЭлектронноеМероприятие = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ОписаниеФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ОписаниеФорматированныйДокумент").Получить();
	КонецЕсли;	
	
	УстановитьДоступностьЭлементовФормы();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОписаниеФорматированныйДокумент = ТекущийОбъект.ОписаниеФорматированныйДокумент.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Для новых объектов получаем параметры мероприятия при помощи функции
	// ПолучитьРеквизитВидаМероприятия, так как при создании на сервере формы
	// Мы еще не знаем для какого мероприятия создается задание.
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Владелец) И ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
		
		СтруктураПараметровМероприятия = ПолучитьРеквизитВидаМероприятия(Объект.Владелец);
		
		ЭлектронноеМероприятие  = СтруктураПараметровМероприятия.ЭлектронноеМероприятие;
		ТребуетсяПреподаватель  = СтруктураПараметровМероприятия.ТребуетсяПреподаватель;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", Параметры.КонтекстРедактирования);
	ТекущийОбъект.ОписаниеФорматированныйДокумент = Новый ХранилищеЗначения(ОписаниеФорматированныйДокумент);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаданиеНаПроверкуЗаписано");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФрагментПриИзменении(Элемент = Неопределено)
	
	Объект.ИспользоватьСтандартныеНастройкиТеста = Истина;
	
	УстановитьДоступностьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтандартныеНастройкиТестаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНавигациюПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НаОсновеЭлектронногоРесурсаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсПриИзменении(Элемент)
	
	Объект.Фрагмент = ПолучитьФрагментЭлектронногоРесурса(Объект.ЭлектронныйРесурс);
	
	ФрагментПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныйРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыСУЗКлиент.РедактироватьЭлектронныйРесурс(Объект.ЭлектронныйРесурс);

КонецПроцедуры

&НаКлиенте
Процедура НесколькоВариантовПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВарианты

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Варианты

&НаКлиенте
Процедура ВариантыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИзменитьПродолжительность(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НачальноеЗначение", Объект.ПродолжительностьВСекундах);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПродолжительностьПродолжение", ЭтотОбъект);		
	
	ОткрытьФорму("ОбщаяФорма.ВводПериодаСУ", ПараметрыФормы,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПродолжительностьПродолжение(НоваяСтруктураПериода, ДополнительныеПараметры) Экспорт
	
	Если НоваяСтруктураПериода <> Неопределено Тогда
		
		Объект.ПродолжительностьВСекундах = ОбъектыSCORM.ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(НоваяСтруктураПериода);
		Объект.Продолжительность = ОбъектыSCORM.ПолучитьПолнуюСтрокуИзКоличестваСекунд(Объект.ПродолжительностьВСекундах);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// НаОсновеЭлектронногоРесурса (важно установить в начале, так как в дальнейшем он используется).
	
	Если ЭлектронноеМероприятие Тогда
		
		Элементы.НаОсновеЭлектронногоРесурса.Доступность         = Истина;
		Элементы.ВариантыНаОсновеЭлектронногоРесурса.Доступность = Истина;
		
		Если НЕ ТребуетсяПреподаватель Тогда
			Элементы.ВариантыНаОсновеЭлектронногоРесурса.Доступность = Ложь; 
		КонецЕсли;
		
	Иначе
		
		Элементы.НаОсновеЭлектронногоРесурса.Доступность         = Ложь;
		Элементы.ВариантыНаОсновеЭлектронногоРесурса.Доступность = Ложь;
			
	КонецЕсли;
	
	// СтраницаНеЭлектронноеЗадание
	
	Если ЭлектронноеМероприятие Тогда
		Элементы.СтраницаНеЭлектронноеЗадание.Видимость = Ложь;
		Элементы.ГруппаФорматированныйДокумент.Видимость = Объект.ИспользуетсяФорматированныйДокумент;
		Элементы.НеЭлектронноеЗаданиеОписание.Видимость = НЕ Объект.ИспользуетсяФорматированныйДокумент;						
	Иначе
		Элементы.СтраницаНеЭлектронноеЗадание.Видимость = Истина;
	КонецЕсли;
	
	// СтраницаЭлектронноеЗадание
	
	Если ЭлектронноеМероприятие Тогда
		Элементы.СтраницаЭлектронноеЗадание.Видимость = Истина;		
		Элементы.ГруппаФорматированныйДокументЭР.Видимость = Объект.ИспользуетсяФорматированныйДокумент;
		Элементы.ЭлектронноеЗаданиеОписание.Видимость = НЕ Объект.ИспользуетсяФорматированныйДокумент;				
	Иначе
		Элементы.СтраницаЭлектронноеЗадание.Видимость = Ложь;
	КонецЕсли;
	
	// СтраницаЗаданиеНаОсновеЭлектронногоРесурса
	
	Если ЭлектронноеМероприятие И Объект.НаОсновеЭлектронногоРесурса Тогда
		Элементы.СтраницаЗаданиеНаОсновеЭлектронногоРесурса.Видимость = Истина;
	Иначе
		Элементы.СтраницаЗаданиеНаОсновеЭлектронногоРесурса.Видимость = Ложь;
		Объект.ЭлектронныйРесурс = ПредопределенноеЗначение("Справочник.СводыЗнанийСУЗ.ПустаяСсылка");
		Объект.Фрагмент          = ПредопределенноеЗначение("Справочник.СодержаниеСУЗ.ПустаяСсылка");
	КонецЕсли;
	
	// Варианты
	
	Если Объект.НесколькоВариантов Тогда
		
		Элементы.СтраницаВарианты.Видимость      = Истина;
		Элементы.СтраницаОбщееОписание.Видимость = Истина;
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Варианты, Объект.Ссылка);
		
		// Скрываем все другие страницы
		Элементы.СтраницаНеЭлектронноеЗадание.Видимость = Ложь;
		Элементы.СтраницаЭлектронноеЗадание.Видимость = Ложь;
		Элементы.СтраницаЗаданиеНаОсновеЭлектронногоРесурса.Видимость = Ложь;
		
		Если ЭлектронноеМероприятие Тогда
			
			Элементы.ВариантыНастройкиЭлектронногоЗадания.Видимость = Истина;
			
			// Настройки электронного ресурса
			
			Если Объект.НаОсновеЭлектронногоРесурса Тогда
				Элементы.ГруппаВариантыНастройкиЭлектронногоРесурса.Видимость = Истина;
			Иначе
				Элементы.ГруппаВариантыНастройкиЭлектронногоРесурса.Видимость = Ложь;
			КонецЕсли;
			
			Если Объект.НаОсновеЭлектронногоРесурса Тогда
				Элементы.ВариантыКоличествоПопытокВыполненияЗадания.Видимость = Ложь;
			Иначе
				Элементы.ВариантыКоличествоПопытокВыполненияЗадания.Видимость = Истина;
			КонецЕсли;
			
		Иначе
			
			Элементы.ВариантыНастройкиЭлектронногоЗадания.Видимость = Ложь;
			
		КонецЕсли;
		
		
	Иначе
		
		Элементы.СтраницаВарианты.Видимость      = Ложь;
		Элементы.СтраницаОбщееОписание.Видимость = Ложь;
		
	КонецЕсли;
	
	// ИспользоватьСтандартныеНастройкиТеста
	
	Если ЗначениеЗаполнено(Объект.Фрагмент)
		И ТипЗнч(Объект.Фрагмент.СсылкаНаЭлемент) = Тип("СправочникСсылка.ПодборкиСУЗ")
		И Объект.Фрагмент.СсылкаНаЭлемент.ЭтоТест Тогда
		
		Элементы.ИспользоватьСтандартныеНастройкиТеста.Доступность = Истина;
		
	Иначе
		
		Элементы.ИспользоватьСтандартныеНастройкиТеста.Доступность = Ложь;
		
	КонецЕсли;
	
	// ГруппаНастройкиТеста
	
	Если ЗначениеЗаполнено(Объект.Фрагмент)
		И НЕ Объект.ИспользоватьСтандартныеНастройкиТеста Тогда
		Элементы.ГруппаНастройкиТеста.Доступность = Истина;
	Иначе
		Элементы.ГруппаНастройкиТеста.Доступность = Ложь;	
	КонецЕсли;
	
	
	// ПереходитьВпередАвтоматически
	
	Если НЕ Объект.ПоказыватьНавигацию Тогда
		Элементы.ПереходитьВпередАвтоматически.ТолькоПросмотр = Истина;
		Объект.ПереходитьВпередАвтоматически = Истина;
	Иначе
		Элементы.ПереходитьВпередАвтоматически.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	// КоличествоПопытокВыполненияЗадания
	
	//Если Объект.НаОсновеЭлектронногоРесурса Тогда
		Элементы.КоличествоПопытокВыполненияЗадания.Видимость = Ложь;
	//Иначе
	//	Элементы.КоличествоПопытокВыполненияЗадания.Видимость = Истина;
	//КонецЕсли;
	
	// КонтролироватьПрикреплениеФайлаКОтвету
	
	Элементы.КонтролироватьПрикреплениеФайлаКОтвету.Видимость = НЕ Объект.НаОсновеЭлектронногоРесурса;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитВидаМероприятия(Мероприятие)
	
	СтруктураРеквизитов = Новый Структура;
	
	СтруктураРеквизитов.Вставить("ЭлектронноеМероприятие", Мероприятие.Вид.Электронное); 
	СтруктураРеквизитов.Вставить("ТребуетсяПреподаватель", Мероприятие.Вид.ТребуетсяПреподаватель); 
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФрагментЭлектронногоРесурса(ЭлектронныйРесурс)
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Возврат Справочники.СодержаниеСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.Ссылка
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Возврат Справочники.СодержаниеСУЗ.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
